[
    {
      "title": "Amazing Spider-man: The Night Gwen Stacy Died",
      "company": "Marvel",
      "characters": "Spider-man",
      "tags": "Action, Romance",
      "keywords": "spiderman, spider man",
      "tldr2": "Gwen Stacy (one of the most important characters to Spider-man) dying and Peter's reaction to it",
      "tldr": "This is one of the most important Spiderman stories every made. In this story, Gwen Stacy dies (definitely not predictable after reading the title) after getting thrown off a bridge by Norman Osborn, the Green Goblin. Peter is broken by her death. Essentially, the story starts off with Peter, Gwen, and Mary Jane trying to visit Harry, but Norman stops them telling them to leave. Peter suspects Norman remembers being the Goblin, and he does once he thinks of Spider-man. Once he remembers, he takes Gwen with him. Peter goes into Gwen’s apartment to see it broken into, and eventually finds Norman and her at the Brooklyn Bridge.  As Peter starts fighting the Goblin, the Green Goblin throws her off the bridge where she dies instantly.  Spiderman then fights with Goblin with murderous rage, and Green Goblin leaves the scene. Then Peter reminsces in memories of Gwen, and in guilt of her death tells the police “Spider-man killed her”. Peter goes to the Osborn’s house to tell Harry, but Harry is psychotic and has difficulty recognizing Peter which makes Peter think there’s no point telling him anything, so as Harry asks him to stay he leaves. Then Peter visits Robbie who lets him know where Norman might be, ending with Peter webbing up Jameson for interfering and making snarky comments about Spider-man.  Peter meets the Green Goblin and they fight with Peter showing full force until he realizes he’s about to kill him. As Peter steps back, the Green Goblin commands his glider to come back to kill Peter, but it doesn’t and instead stabs him as Peter dodges. The story finally ends with Peter harshly speaking to Mary Jane as she tries to comfort him as Peter says she would not care if her own mother died. This moment is important because it’s the start of the development of Mary Jane’s character into being more emotional rather than someone who just liked to party and have fun.",
      "id": "1"
    },
    {
      "title": "Spider-man Blue",
      "company": "Marvel",
      "characters": "Spider-man",
      "tags": "Action, Romance",
      "keywords": "spiderman, spider man",
      "tldr2": "One of the best Spider-man stories showing the lingering nature of Peter's love for Gwen.",
      "tldr": "Spiderman Blue is one of the most quintessential Spiderman love stories capturing the character’s love of Gwen. Basically, the story begins with Peter speaking into a recording device on Valentine’s day, telling the story of how he met Gwen and fell in love with her. Eventually Mary Jane ,who in this story is his wife, finds out he’s recording, but doesn’t interrupt the recording and lets him speak. This story is important in understanding Spiderman as a character and how Peter was as a college student in the times he met Mary Jane and Gwen.",
      "id": "2"
    },
    {
      "title": "Amazing Spider-man: Parallel Lives",
      "company": "Marvel",
      "characters": "Spider-man",
      "tags": "Action, Romance",
      "keywords": "spiderman, spider-man",
      "tldr2": "Story showing Peter and MJ's life from high school to adults parallelly, illustrating the connection the two have formed.",
      "tldr": "This story is essentially written to be a tribute to the Peter MJ relationship surrounding the comics. The story starts by teling Peter and Mary Jane’s stories in parallel. So it begins with Peter’s parents giving him to Aunt May and Uncle Ben, and MJ’s dad being violent to them in the home. As next door neighbors, MJ describes the first time she sees Peter as “cute in a nerdy way”. Then, it explains Peter’s origin as Spider-man., up to him designing the suit for a wrestling competition. Conversely, they show Mary Jane’s life as a carefree party goer enjoying her life in an attempt to mask the pain she faces at home such as being afraid of the boy that married her sister. She then says she enjoyed Spider-man then because he enjoyed life,like she was supposed to, and he wore a mask to hide his identity.  Then Uncle Ben dies, and we see an example of MJ being carefree. Then, while Peter changes into Spider-man to stop Uncle Ben’s killer, Mary Jane sees him crawl out his room deducing he’s Spider-man. Then Peter finds out the killer was a thief he could have stopped and feels culpable for the death. Mary Jane parties in an attempt to erase her memory of  seeing Peter as Spider-man, but it ends up being futile. This illustrates an important point of the story in which Mary Jane’s character revolves around “masking” her sorrow by partying and having fun versus just showing her sadness.  Then, they explain how Doctor Octopus becomes a super villain, and Peter says that after being Spider-man he’s learnt with great power comes great responsibility as he tackles down Kraven. Following that, he goes home to hear Aunt May she has set up a blind date for him with Anna Watson’s niece. Peter reacts surprised scared to see what May has come up. MJ reacts with a comparison of Peter to her father which she says she may have done because she knew he was Spider-man.  On the way out from the Daily Bugle(where Peter is employed for this story), Betty asks Peter out, but he says no because he has the date with MJ. Then, May tells him they have to cancel because MJ is under the weather, so Peter calls Betty yet gets turned down because of how he treated her earlier. However, we find out MJ lied about being sick to get out of the date. Then, 2 years pass by and Peter graduates going to ESU after dating Betty Brant. Then Aunt May gets hospitalized because she has radioactive blood in her bloodstream(which Peter gave in a blood donation), so Peter becomes preoccupied with that he doesn’t heed attention to his friends. During this time, MJ moves to Philly. After meeting Curt Connnors,Peter finds out he needs a substance to save May, but the Master Planner has stolen that substance. Then Peter finds out the real identity of the Master Planner(which you should read the story to find out), and gets trapped under a fallen wall. He escapes the wall with the sole motivation of saving May. Eventually, he remains successful and saves May. On Mary Jane’s side, her sister’s husband leaves her and she asks MJ and her mom to stay with her while she delivers the baby. This shock causes stress to MJ’s mom and causes her to die. Here, MJ says she wanted to be free like Spider-man.  MJ’s sister gives her details about what to do, and she leaves the home unhappy feeling that her plan is just giving up dreams to make someone happy. She settles on moving with Anna Watson. Then, Mary Jane meets Peter for the first time. Then, we see Otto at May’s house attempting to deceive her until Peter comes which makes Otto want to get unique revenge on Peter. Then Peter and MJ get married. Then one of Doctor Octopus’s robots(the term I am not sue of) attacks them in the house and Peter realizes Otto has planned something. Then Peter goes and fights Ock in which case Otto says he’s doing this because he thinks Spider-man and Peter both have ruined his life(he obviously doesn’t know they are one in the same). Then Peter nearly dies multiple times and defeats Otto as he dies in the East River.  The story ends with Peter going and telling MJ he can’t take risks anymore, and that all this is his fault. MJ tells him that people take risks so they can grow, and they take responsibility for their lives because it’s right not because they can predict the outcome.",
      "id": "3"
    },
    {
      "title": "Batman: The Dark Knight Returns",
      "company": "DC",
      "characters": "Batman, Superman",
      "tags": "Action",
      "keywords": "kryptonite, bat-man, super-man, caper crusader, Frank Miller",
      "tldr2": "One of the most iconic Frank Miller stories about how Batman comes out of retirement, old and worn out, just to fight crime once more.",
      "tldr": "The story starts off with Bruce Wayne in a car race. Then, it transitions to a conversation between Jim Gordon and Bruce about how it has been 10 years since the Batman was last seen. After the conversation, Bruce says he feels like he has been dead for 20 years. Bruce walks around the city until stopped by muggers who give up because he will put up a fight. However, he thinks about how crime has become rampant in the city. The “Mutant” gang is the gang suspected for being the leaders of the new crime wave around the town. Then, it switches over to Harvey Dent. We learn that Harvey’s face has healed up from being Two-Face, Bruce Wayne sponsored his treatment, Bruce Wayne believes Harvey can reform, and Gordon doesn’t. After that, the story flashes to interesting narration by Bruce about the physical bat, how it struggles relentlessly to be free, and how Bruce will not be Batman again as that as the word he’s given for Jason Todd. Then, we see Bruce watching TV just for it show Zorro, the movie Bruce was watching when his parents died. Bruce then checks his phone/inbox to see a message about Superman leaving, and a message from Selina Kyle about how she was lonely. Then, we just seeing the “Mutants” ravaging around the town committing many crimes until Batman returns. The first time Batman comes back, Bruce says he should be in agony and he would be if he was older, but wearing the suit again makes him feel reborn again. Then, Batman busts the crooks. After that, we see debate over the return of Batman in the city. Afterwards, this is followed up with debate over if Harvey Dent is returning to crime after 2 helicopters are stolen. Then, Bruce gets into some sorts of a conflict with Harvey and sees him without bandages. He sees Two Face without damage and says he sees a reflection. Following that, Carrie Kelley dons the Robin suit for the first time.  She fights local crime, and eventually wants to go to a Mutants level crime because Batman will be there.  She gets her wish because as Batman fights the leader of the Mutants, he wishes for someone like Dick to come as he is worn out and tired, and he gets exactly what he wanted: Carrie Kelly. Then Bruce accepts Carrie as a future Robin. Then Batman finally defeats the Mutants and Jim Gordon retires. Bruno(new character) starts a gang, and Bruce gets involved with them in the alley. Then Batman takes her out, and tells her not to interfere. Then, Bruce meets Clark. Clark tells Bruce he is in way over his head and there will be a team where someone asks him to bring Bruce in. Bruce functionally says may the best man win. Now, the Joker enters the story. The Joker creates mayhem across the city, and chaos ensues. Carrie gets into a side fight, and Batman fights the Joker. However, as the Joker falls he says to Batman that he only paralyzed him and he couldn’t finish the job. Then the Joker kills himself. Bruce then gets hurt, and the sons of Batman take the streets.  The story then continues with the russians firing a nuke in anger for pulling out of Corto Maltese. Superman shields the nuke, but causes power loss in the process. This means things like planes lose power and a plane falls causing destruction throughout the city. The Sons of Batman are confused what to do, but Batman comes in and tells them that they need to be the law and use their fists and brains - not guns. Then Bruce meets with Oliver who asks for a piece of Superman when they fight because of their differences in ideologies.  Batman and Superman finally fight. Then as Bruce is on the ground, Oliver shoots a kryptonite service at Clark. Bruce just says this is the end for both of us. Batman tells Superman he wants him to remember the man who beat him, but then he falls to the ground. Then, Bruce Wayne’s heart reportedly stops beating and he has a funeral in which everyone attends. However, at the end Superman hears a heart beating and smiles. So the story ends with Bruce committed to fighting crime in the shadows.",
      "id": "4"
    },
    {
      "title": "Flashpoint",
      "company": "DC",
      "characters": "Batman, The Flash",
      "tags": "Action",
      "keywords": "flash, bat-man, time travel",
      "tldr2": "Barry Allen creates a new timeline in which his mother didn't die and learns the disastrous consequences of time travel.",
      "tldr": "This story is about Barry traveling back in time, and undoing the death of his mother. However, he sees the consequences of it in his new world. His mom is alive, his dad is dead, there is no Superman, there is no Justic League, and Captain Cold is Central City’s greatest hero.  This world’s Batman is revealed to be Thomas Wayne, the father of Bruce Wayne. Barry meets Thomas and tries to explain everything, but here the altered memories of the timeline ring in. Also, in this world Martha Wayne is the Joker as she goes insane after seeing Bruce die. In this world, it’s Bruce that dies not his parents. Conversely Deathstroke tries to look for his daughter by going across the sea, but Emperor Aquaman comes and stabs him in the chest. One of those members of his crew removes a piece of the trident and heals him.  Barry then tries to recreate his powers as the Flash by recreating the accident, but the inital attempt fails and leaves him badly burned. However, a second attempt works and he concludes the Reverse-Flash changed history to stop the formation of the Justic League. Then, they learn Superman was put into a containment cell when he came to Earth, so they go to meet him. Upon meeting, they release this might be the first time he has seen others or been outside.  Conversely, in this world tensions between Wonder Woman and Aquaman escalate into  casualty. an Atlantean-Amazon war. There is a failed attempt at an assault in England, but Hal Jordan(who doesn’t become Green Lantern in this timeline) is the first casualty.  Flash gets the different Batman to join him as he says if he fails to stop the Reverse-Flash, the world will destroy itself.  Then, they get the Marvel Family, and  the Marvel Family transforms into Captain Thunder. They attack Wonder Woman, and it all goes down hell when Enchantress and Penthesila restore them to mortal forms and kill Billy Batson. Here, Thawne comes into the story, and explains what happened. The new timeline is not a result of him, it’s a result of Barry. Thawne didn’t time travel to stop the Justice League from being formed, Barry time traveled to stop his mother’s death. Thawne continues to taunt Barry with this revelation, but he then gets killled with an Amazionian sword by Batman. Before Barry goes to restore the timeline, Thomas asks him to give Bruce(the Batman in the timeline he will go to) a letter. Barry then meets his mother and says goodbye. The story ends with Barry stopping himself stop Thawne killing himself spunning rise to the New 52 timeline in the DC universe. Additionally Barry gives Bruce the letter, and he is deeply touched, crying and expressing his gratitude to Barry.",
      "id": "5"
    },
    {
      "title": "Origin of Iron Man",
      "company": "Marvel",
      "characters": "Iron Man",
      "tags": "Action",
      "keywords": "ironman, iron-man",
      "tldr2": "The story of how Iron Man was born.",
      "tldr": "Tales of Suspense #39 The story begins with Tony Stark, industrialist for Stark Industries which is producing weapons for the government. showing weapons at a weapon demonstration to the government for the Vietnam war. Tony then goes onsite to the war to see if his weapons have worked and if they need repair. However, there Tony falls victim to a booby trap and gets severely wounded with shrapnel in his chest. The people that save him know the shrapnel wil eventuallyl kill him, but they want to make use of his intellect before he dies. Therefore, they ask him to make a weapon for them. However, here Tony builds the first Iron Man suit inspite of his agreement to making them a weapon. While building, he gains the friendship of Professor Yinsen, a brilliant physicist who helps him build it. As they set up the suit, Yinsen hears the people overseeing Stark coming, so in order to buy Tony time he goes out and sacrifices himself to die. Stark then gets out the suit, and enraged to see Yinsen killed he takes revenge on the people that killed him. Except he doesn’t do so as Tony Stark, he does so as the Iron Man.",
      "id": "6"
    },
    {
      "title": "Origin of Spider-man",
      "company": "Marvel",
      "characters": "Spider-man",
      "tags": "Action, Comedy",
      "keywords": "spiderman, spider man, ",
      "tldr2": "How the webslinger as you know him got his powers",
      "tldr": "This story is one of the most influential comics ever written because it details the origin of Spider-man(alias Peter Parker). The story starts out with Peter Parker, a shy timid high schooler that lives with his aunt and uncle get ridiculed at school from people like Flash Thompson for being nerdy. Then, Peter goes to a public science demonstration where he gets bit by a radioactive spider. Right before a car runs over Peter, he jumps up, and sticks to a roof which he scales in a few seconds. He then realizes he has super speed, super strength, and the ability ti stick to walls. At a paid wrestling competition(where money is offered to the man who can stay in the ring three minutes with a wrestler), Peter easily wins the money and lands a spot on the “Ed Sullivan” show. Peter makes a suit,dons the name “Spider-man”, and performs on the show and amazes the audience. As Peter leaves, he sees a thief running to the elevator, but doesn’t stop him because he has learnt to only look out for himself(in other versions, this is because he didn’t get the money he was promised). One day, Peter returns home to see a police car indicating his Uncle Ben has been shot. The police tells Peter which warehouse the killer is hiding, and Peter runs off to that place to see if he can use his Spider powers to stop the killer. In the process, he sees the killler’s face to see it was the same person he let escape in the elevator that day. Here, Peter learns the lesson that will ground his career as Spider-man : with great power comes great responsibility.",
      "id": "7"
    },
    {
      "title": "Spider-man: Best of Enemies",
      "company": "Marvel",
      "characters": "Spider-man",
      "tags": "Action, Comedy",
      "keywords": "spiderman, spider man",
      "tldr2": "A story of true friendship between Harry and Peter or the Green Goblin and Spider-man",
      "tldr": "Spectacular Spiderman #199-#200 The story starts off with Spiderman concluding his adventure with the X-men(which reading the previous issue would explain). Then, Peter goes to see his parents (this was a weird time where they brought back Peter’s parents but they weren’t actually his parents). May argues with Mary(Peter’s biological mother) about Peter when May says Peter has been into photography for a while, so it will take a while for him to return, and Mary retorts with May is just trying to gloat because she was in Peter’s life when they weren’t. Richard(Peter’s dad)then points his finger at Peter and yells at him for vanishing inconsiderately to which Peter retorts that he had to do something important and he doesn’t need Richard trying to give advice after not being there in his life for so long. They all make up, and Peter is on the subway when someone comes up to him and starts harassing him, so he almost shatters their wrist accidentally. Peter then returns home to see Harry Osborn there who was just released from the Vault(prison for super criminals). Then they leave, and Peter tells Mary Jane that she has to leave immediately since the Green Goblin is now their neighbor. MJ then gets mad at Peter for not asking her what she wants to do, and leaves. Peter goes to Liz’s house to see Harry but he’s not there. He is actually in Green Goblin costume and kidnaps Mary Jane. Peter then leaves to look for MJ because he is frightened MJ has been kidnapped by Harry. Harry takes her to the Brooklyn Bridge(where Gwen died). However Harry sits MJ down there and explains to her that because of their friendship and the impact she has had on his life, Harry will never go to that extent. Then Peter busts a house break in going very hard at the criminals almost seeing Harry in the criminals. After Peter goes back to the apartment to see MJ and Harry there. Peter goes and attacks Harry but they explain to him Harry just wanted to talk to her which makes Harry proclaim Peter is ready to assume the worst of him. Peter and MJ then argue about what to do, but eventually can’t come up with anything. Harry goes home to Liz and he gets mad at her for telling him to watch out for his fever because he thinks he is trying to indicate “the Osborns aren’t strong”. Harry, to get at Peter, follows him throughout the city and creeps up on him at the worst times as Green Goblin. MJ tries to convince Liz how messed up everything is, but she can’t. MJ then goes to their house to talk to Harry about the love they have for each other is what’s retaining their bond, but she is unsuccessful. Then Peter is at the house because his spider sense goes off. Harry and him fight it out, but Harry decides to blow up the house with both of them in it because it’s what he feels they deserve. Harry then realizes MJ and his son are in the house, so he escorts them out because Peter is too weak to move. Harry then rescues Peter, and the house explodes. However Harry is too weakened due to the effects of his Goblin formula, and as he is about to pass out, he tells Peter he did it because it’s what a best friend would do, ending the story commemorating their friendship.",
      "id": "8"
    },
    {
      "title": "Origin of Batman",
      "company": "DC",
      "characters": "Batman",
      "tags": "Action",
      "keywords": "bat man, bat-man",
      "tldr2": "How the Caped Crusader came to be.",
      "tldr": "Detective Comics #33 Bruce Wayne is walking home from a movie with his father, Thomas, and mother, Martha,. They are approached by a mugger who tries to grab Martha’s pearl necklace, but the mugger kills Thomas and Martha and leaves Bruce to live because he doesn’t have the heart to kill a child. This makes Bruce vow to take vengeance, so he spends the next years of his life preparing. He becomes an intelligent scientist and pushes his body to human perfection. One night, he is thinking of a disguise and settles on a bat, thinking he could strike fear into his enemies the same way bats struck fear into him. With this, the Batman is born.",
      "id": "9"
    },
    {
      "title": "Green Arrow/Green Lantern(issues  1-7)",
      "company": "DC",
      "characters": "Green Arrow, Green Lantern",
      "tags": "Action, Drama",
      "keywords": "black canary, medusa, batman, superman",
      "tldr2": "One of the first series to challenge social settings and societal norms in comics, Green Arrow/Green Lantern showcases the struggles with the world both characters have had to face with their differing perspectives and the contrast of those perspectives.",
      "tldr": "The story begins with Green Lantern saving a man from getting mugged, but as the mugging continues rioters start throwing things at Green Lantern. Green Lantern to attack the rioters is stopped by Green Arrow who won’t let him lay a finger on the “anarchists”. Green Arrow begins to show Green Lantern the other side of the criminals he takes down i.e the tough family situations they go through and how most people like Green Lantern can’t even begging to understand it. Green Lantern retorts with I have a job to do and I do it. Then, a black man comes up to Green Lantern and asks if he has helped out with orange and purple skins on various planets, why he can’t  help the black skins here to which he can’t answer. This sets the tone of the series : Green Lantern’s idealogy will be tested to become more real world applicable as he gains more insight on some of the problems he can’t fight as a super hero. Green Lantern makes the vow to put he ring on once more and think that his vow has not been told truthfully as evil has been around him - not a bug-eyed monster or mad scientist. Green Latern then goes to talk to the landlord to help the impoverished, but his effort is futile and he gets called back to OA for the lanterns. The OA instructs him to solve a meteor shower. Green Arrow feels as though this mission isn’t very useful, so he goes back to Earth. Then Green Arrow goes to the landlord, and tortures him to meet up at a midnight at an abandoned stores. However the landlords’ thugs go instead of him and they remain unsuccessful. Then Green Lantern, Green Arrow, and the Star City DA go to the landlord and force him to get arrested helping people pay their rent. Then the OA goes to Earth as human, and travels with Green Arrow/Green Lantern around the country. They go and meet Jacob, a man who is leading a mining rebellion or at the very least helping people organize. Green Lantern stops to fight and sees the Guardians remove his shield from protection, but he thinks the pain gives him self reliance as he wins. Green Arrow then fights, and plays possum to trick the enemy. When he shows his hand, Jacob comes out helping the opposition just to show he back stabbed the miners. Then, Greeen Lantern comes and saves Green Arrow.  Then, Black Canary gets in the story and gets hurt by a biker gang. After a few weeks, Green Arrow/Green Lantern go to the town. They go to a native American restaurant and are insulted which prompts them to fight. They win pretty easily and Green Arrow uses a cool arrow that can trap someone on a motorcycle. They see one of the thugs has Black Canary’s motorbike and find out it’s been taken away from here. Green Arrow nearly kills thug trying to determine where Black Canary is. Then, they go to apologize to the owner is native American, and he says that white beings have been walking over them for 400 years, so there is no point in showing remorse now which speaks to the acknowledgement of settler colonialism in the comic. They then find Black Canary, who is now part of the Englightened lead by Joshua.  Black Canary begins thinking of Oliver until Joshua hypnotizes her into using a gun.  Green Arrow gets so mad Canary didn’t want to be with him, he punches Green Lantern when he says so. Then Green Arrow stumbles upon Joshua controlling his followers including Canary through brainwashing. Green Arrow shoots a flare arrow to signal to Green Lantern, and Green Lantern defeats them. However, Canary with Joshua finds Oliver fallen all alone. Canary is instructed to kill him, but she can’t pull the trigger. Then, Joshua tries to do it himself before Green Lantern stops it. Canary then tells Green Arrow she doesn’t know how what happened and he says that they need to try to understand how the hearts of decent people can be seized. The next adventure has the two help a native tribe in conflict with some settlers. Here, Green Lantern becomes sick of Green Arrow trying to show he’s morally superior, and he syas he can break the law but not to count him in with it. Green Lantern tries to help legally, but struggles only helping some people come out of a fire. Then Arrow and Canary figure out they need to find a way to restore the sense of community the natives have. Suddenly, a figure the claims to be a Ulysses Star ghost figure to restore the former greatnness of the tribe. Green Lantern then brings representative Sullivan to look into the tribe’s claims, but the ghost figure challenges him. Then Green Lantern fights the figure, and it is revealed to be Green Arrow. After, they realize their fight didn’t bring much, and Green Lantern realizes going through the senator will just cause suffering because the natives will suffer until the 5-10 years to pass legislation. In the next adventure, a truck demolishes their truck and they try to help some local marine repair. Green Lantern nearly dies, but the Guardian saves him. Green Arrow and the members of the ship dump the gunk in the barrels. The next day they walk Green Lantern out of the hospital, and the Guardian with them gets in trouble for using his power to save Green Lantern versus the whole ship. Then, the Guardian has to appear for trial. However, the trial is really unfair and the Guardian gets the death penalty. Then, they meet some natives of Gallo(planet trial was on) who was the actual tribune for the penalty. They say the master judge has become insane an planned a revolt with the metal police. Then Green Arrow uses an arrow head to defeat Serbus, one of the robots. Then, the actual death penalty happens.  Green Lantern gets his ring back(he got it taken away when the death penalty verdict was reached), but it’s harder for him to use. They somehow save their Guardian together, and the story endst here.  Then, the trial continues with all of the OA.  They decide to strip the Guardian of his immortality and he goes back to the home planet OA mortal.  Green Lantern tells them he might resign, and they fear in losing him, but also think his one weakness is that he’s too human. They all go to the home planet(Maltus), and are met with animosity. They find out this is due to overpopulation on the planet due to cosmic dust affecting reproduction and kids created by Mother Juna. They all then see the effects of over-population using an OAN bubble. Green Lantern then takes them to Mother Juna’s lab. There, Black Canary defeats what is referred to as the local greeter. Then they all fight in conjunction defeating Juna. Juna says she did what she did because she was infertile and wanted to have children. Then the Guardian says he doesn’t really care if he’s not immortal anymore and thinks there is great things he can do on Maltus, so they leave him. This adventure ends with Canary telling Oliver there’s nothing that matters except whatever love people have for one another.  The next adventure begins with Oliver meeting Canary giving her a box of roses. She opens it just for monsters to come out. Oliver sends out a tear gas arrow, and they blow it back in their face. They then see the house looks empty excet the box and the roses. They then tell Hal, and he comes as Green Lantern. He then goes and finds the monsters where one of them identifies them as the Witch Queen. He then gets trapped into a gem. Oliver and Canary, tired of waiting for Green Lantern, go out themselves and some new monster harms Oliver. Canary beats them all, and they ask her to join her after they explain her backstory. The story than becomes mystical as it shows a wizard wanting to be with a priestess, but as he gets rejected he becomes insanely good at magic. They then release Green Arrow, and say that their purpose is to make all men pay for crime of the wizard. Then they fight the brother-sister duo. Then Green Arrow fights Sinestro and Black Canary saves him. Then, they go to the place where Green Lantern is, but they don’t let Green Arrow travel. Lantern’s dimension is one of sanity, and the lady he meets identifies herself as Medusa. Medusa traps him and Green Lantern is saved until Canary saves him. Then, they take him and e xplain to Green Arrow what happened. The next story is about Canary, and her new job at a school. There, she meets Jason Belmore, the lead,  and Grandy, the cook. Then, Green Latern meets Carol Danvers(the girl he used to love) once more. Then, they find out Canary’s school is super messed up because they have kids to do their dirty bidding for them. Then, the cook Grandy is revealed as the one evil. Then, they take Canary to a hospital for the damage the opposition has done to her, and Hal reunites with Carol. The next adventure first describes Green Lantern reminiscing his time with Carol. One day he goes to visit Oliver when the radio says where Carol is here(she had to meet a manager near a dam for work) is gonna be impossible to evacuate. Upon hearing this, he goes off immediately. He fixes the dam, and the man Carol came to see tells him he has to show him the city. He shows him his borderline insane vision for the city which includes showing him a device that gives a tickle and puts perfume in his nose. Green Lantern tries to escape but can’t due to the place’s nature disrupting his will power prompting that person Lantern met to get people to attack him. Then, after signaling to Green Arrow what happened, Black Hand is revealed as the goon behind the operation. He then indicates he has the power to brainwash people which he will use to make Piper’s Dell(where Carol went) expansive across the world. Then, for some reason he gives Carol back to Green Lantern, and as they walk out some people want to attack Green Lantern. Green Arrow finally figures out Green Lantern’s signal and suits up as Green Lantern. As Green Lantern is with Carol, and almost attacked, Green Arrow pulls up and gives him back the ring. Then. Green Lantern gets his ring back and beats up Black Hand. The foregoing adventure is about  is about Speedy, Green Arrow’s sidekick. Oliver gets mugged, but he beats almost everyone except one kid with a cross bow. He then calls Green Lantern, and then tells him the arrow is one of his. They then see a kid who is a drug addict getting violated by a drug dealer. Then, they meet some kids involved in drug peddling with one of them being Speedy, and Green Arrow assumes it’s him being undercover. They both get beaten up with drugs in their system, so when Speedy asks Green Lantern to use his ring he can’t correctly and sees monsters. It doesn’t matter though as they all get home. Here, Speedy says he did it all to be undercover, and explains why those kids may have been on drugs. However, he was just capping, and it’s revealed he is on drugs.  Green Arrow beats Speedy when he finds out, and wonders how it could have happened. So, he goes back to where he met Speedy with the other kids. Conversely, some kids break into Oliver’s apartment, and take drugs with one dying as he overdoses. On the other side of things, Green Lantern feels disturbed by Speedy’s explanation for why they might one be drugs, so he dips and looks for them. Lantern then finds Speedy who he takes to Dinah. Speedy tells GL he started bcause he was not confident of the previous generation’s statements about something, and if they would be right about drugs. Examples include the generation telling kids a man’s worth is the size of money in his bank and war is fun. Then Green Arrow sees a party full of drugs, and as he approaches it he gets beaten up. Then, Oliver meets Green Lantern and he defeats the guys that beat Green Arrow up. Oliver and Hal go to Mr. Hooper(a drug trafficking entrepreneur), and beat him up.  Then, at the funeral for the boy who dies as he overdosed, Speedy comes and punches Oliver. Here, he explains he punched him because Oliver misidentified the problem. Drugs are not a disease, but rather a symptom that kids who have an uncaring/unthinking society turn on them have to face.  The next adventure begins with Guy Gardner getting hurt as he tries to help a girl off an earthquake created cliff. Guy gets a severe injury, and the Guardians instruct Green Lantern to find a new successor to the Green Lantern mantle. They then choose John Stewart, and despite Hal’s initial racist reactions they meet up and he trains him. As the training goes, Stewart isn’t like a traditional GL annoying Hal because he’s not going to do something like save a racist. Stewart stops a shooting that was supposed to be in a stadium, the real shooting happened in the parking lot. Hal initially thinks he is just misusing his power until he hears this explanation.  The other adventure is solely about Oliver. Oliver runs throughout Star City fighting crime, but doesn’t feel complete. It’s not enough. He wants to do something not as Green Arrow, but as Oliver Queen. As he thinks that, he gets a call to run for mayor. He asks Dinah, Bruce Wayne, and Clark Kent, but they all say it wouldn’t work.  As this happens Oliver gets caught in the middle of a riot, and as he asks a boy what is happening, the boy dies of shock. The story ends with Oliver going to Diana, and telling her he has to run for mayor because of what he just saw happen to that boy.  The next adventure starts with Oliver getting invited by Hal to Abraham(a place Carol is in charge of). As Ollie practices archery he is stopped by a cop, who he easily defeats, but he gets the vibe this intlddividual is not to be trusted. Then, he meets Isaac. Conversely, Green Lantern saves Carol from an accident which he thinks isn’t an accident and was deliberate. His proof is that there were trenches dug around the rig’s supports, and the weight of the pipes causing the support to slip. Isaac then fixes GA’s muscle imbalance, and says he had lung disease due to industrial pollution. He would have died, but he just became one with nature.  Then GL comes, and tells GA that Isaac has actually killed tons of people. Green Lantern tries to bring Isaac in, but Green Arrow stops him using a sleeping gas arrow. Isaac then gets mad he didn’t use gas polluting the environment. The cops then come back with more support and successfully apprehend Green Arrow/Green Lantern.  However, Isaac dressed up against a cross like figure is tied to a ship protesting the pollution happening there. The people benefitting from the economic benefits of the pollution want Isaac dead, but GA/GL work together to ensure that doesn’t happen. The efforts remain futile though as Isaac dies. The story ends with Green Lantern destroying a nine million dollar aircraft that Carol owns because it could hurt the environment. The final adventure starts with Green Arrow fighting a crime and realizing he’s accidentally killed someone. Green Latern hears from Dinah he’s shook and goes to his apartment check up on him. There, someone plants a bomb, and it explodes. As Oliver is up in the air driving a jet, we see his guilt for his mistake : he missed the criminal’s sniper and hit his head killing him.  He then crashes the “Arrow Plane”, and surrenders at a monastery asking them for help in forgiving himself. Conversely, a worried Black Canary gets intermingled with Joshua’s sister(see earlier parts of tldr for reference), and is saved by Green Lantern. Then Black Canary gets run over by a car. Green Lantern finally finds Green Arrow, and he agrees to come with GL to civilization because of how badly Dinah is hurt.  A new enemy, Rink Willard Grovel, attacks them. It ends pretty badly with Oliver getting hospitalized. The story ends with Oliver and Canary with beds next to each other in the hospital as Oliver says he’s happy he found himself. ",
      "id": "10"
    }
  ]